# Data Exploit

In [1]:
import pandas as pd
import numpy as np

Primeira fase carregar e previsualizar o Data Set:

In [2]:
df = pd.read_excel('default_of_credit_card_clients__courseware_version_1_21_19.xls')
df.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,798fc410-45c1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
1,8a8c8f3b-8eb4,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,85698822-43f5,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,0737c11b-be42,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,3b7f77cc-dbc0,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

retirar mais informacoes do Data Set usando .shape() a saida sera linhas e colunas

In [3]:
df.shape

(30000, 25)

mais informacoes do data set com .info() ou .head():

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30000 non-null  object
 1   LIMIT_BAL                   30000 non-null  int64
 2   SEX                         30000 non-null  int64
 3   EDUCATION                   30000 non-null  int64
 4   MARRIAGE                    30000 non-null  int64
 5   AGE                         30000 non-null  int64
 6   PAY_1                       30000 non-null  object
 7   PAY_2                       30000 non-null  int64
 8   PAY_3                       30000 non-null  int64
 9   PAY_4                       30000 non-null  int64
 10  PAY_5                       30000 non-null  int64
 11  PAY_6                       30000 non-null  int64
 12  BILL_AMT1                   30000 non-null  int64
 13  BILL_AMT2                   30000 non-null  int64
 14  BILL_AMT3                   30000 non-null  int64
 15  BILL_AMT4                   30000 non-null  int64
 16  BILL_AMT5                   30000 non-null  int64
 17  BILL_AMT6                   30000 non-null  int64
 18  PAY_AMT1                    30000 non-null  int64
 19  PAY_AMT2                    30000 non-null  int64
 20  PAY_AMT3                    30000 non-null  int64
 21  PAY_AMT4                    30000 non-null  int64
 22  PAY_AMT5                    30000 non-null  int64
 23  PAY_AMT6                    30000 non-null  int64
 24  default payment next month  30000 non-null  int64
dtypes: int64(23), object(2)
memory usage: 5.7+ MB

Examinar as as colunas:

In [5]:
df.columns

Index(['ID', 'LIMIT_BAL', 'SEX', 'EDUCATION', 'MARRIAGE', 'AGE', 'PAY_1',
       'PAY_2', 'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6', 'BILL_AMT1', 'BILL_AMT2',
       'BILL_AMT3', 'BILL_AMT4', 'BILL_AMT5', 'BILL_AMT6', 'PAY_AMT1',
       'PAY_AMT2', 'PAY_AMT3', 'PAY_AMT4', 'PAY_AMT5', 'PAY_AMT6',
       'default payment next month'],
      dtype='object')

verificar se nao ha duplicidade nos dados:

In [6]:
df['ID'].nunique()

29687

tem como contar usando .value_counts() similar a GROUP BY/COUNT em SQL:

In [7]:
df['ID'].value_counts().head()

e7f574b9-0581    2
7b6e060a-97a0    2
fc73f07e-eb96    2
0d66d575-c461    2
9db1809e-845a    2
Name: ID, dtype: int64

Varoles agrupados UNICOS x DUPLICADAS

In [8]:
id_counts = df['ID'].value_counts()
id_counts.value_counts()

1    29374
2      313
Name: ID, dtype: int64

Aplicar Mascaras Booleanas que servem para filtrar os dados ate chegar no objetivo da exploracao:

In [9]:
dupe_mask = id_counts == 2
dupe_mask[0:5]

e7f574b9-0581    True
7b6e060a-97a0    True
fc73f07e-eb96    True
0d66d575-c461    True
9db1809e-845a    True
Name: ID, dtype: bool

Filtrando criando um array para armazenar o indice dos valores duplicados:

In [10]:
dupe_ids = id_counts.index[dupe_mask]
dupe_ids = list(dupe_ids)
print(len(dupe_ids))
print(dupe_ids[0:5])

313
['e7f574b9-0581', '7b6e060a-97a0', 'fc73f07e-eb96', '0d66d575-c461', '9db1809e-845a']

In [11]:
df.loc[df['ID'].isin(dupe_ids[0:3]),:].head(10)

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_1,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
15260,e7f574b9-0581,290000,2,2,2,29,-1,0,0,0,...,31404,31004,29124,15000,2000,3000,0,0,4280,0
15360,e7f574b9-0581,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
23346,7b6e060a-97a0,240000,2,1,2,33,0,0,0,0,...,230758,196830,201112,9582,9963,8013,6658,7059,6609,0
23446,7b6e060a-97a0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
27152,fc73f07e-eb96,280000,1,3,1,44,0,0,0,0,...,57115,54076,58155,4000,15000,3026,3000,8043,2000,0
27252,fc73f07e-eb96,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

Para limpar o Data Frame precisamos criar uma Mascara Booleana do tamanho do Data Frame que vai ser limpo:

In [12]:
df_zero_mask = df == 0

Mascara Booleana que identifica que todos os elementos apartir da segunda coluna sao iguais:

In [13]:
feature_zero_mask = df_zero_mask.iloc[:,1:].all(axis = 1) 

print(feature_zero_mask.shape,end='\n\n')
print(sum(feature_zero_mask))

(30000,)

315

Fazendo a limpeza no Data Frame Original usando .loc[]:

In [14]:
df_clean = df.loc[~feature_zero_mask,:].copy() #verificar

print(df_clean.shape,end='\n\n')
print(df_clean['ID'].nunique())

(29685, 25)

29685

In [15]:
#Buscando mais informacoes

df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 29685 entries, 0 to 29999
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          29685 non-null  object
 1   LIMIT_BAL                   29685 non-null  int64
 2   SEX                         29685 non-null  int64
 3   EDUCATION                   29685 non-null  int64
 4   MARRIAGE                    29685 non-null  int64
 5   AGE                         29685 non-null  int64
 6   PAY_1                       29685 non-null  object
 7   PAY_2                       29685 non-null  int64
 8   PAY_3                       29685 non-null  int64
 9   PAY_4                       29685 non-null  int64
 10  PAY_5                       29685 non-null  int64
 11  PAY_6                       29685 non-null  int64
 12  BILL_AMT1                   29685 non-null  int64
 13  BILL_AMT2                   29685 non-null  int64
 14  BILL_AMT3                   29685 non-null  int64
 15  BILL_AMT4                   29685 non-null  int64
 16  BILL_AMT5                   29685 non-null  int64
 17  BILL_AMT6                   29685 non-null  int64
 18  PAY_AMT1                    29685 non-null  int64
 19  PAY_AMT2                    29685 non-null  int64
 20  PAY_AMT3                    29685 non-null  int64
 21  PAY_AMT4                    29685 non-null  int64
 22  PAY_AMT5                    29685 non-null  int64
 23  PAY_AMT6                    29685 non-null  int64
 24  default payment next month  29685 non-null  int64
dtypes: int64(23), object(2)
memory usage: 5.9+ MB

In [16]:
df_clean['PAY_1'].head(5)

0     2
1    -1
2     0
3     0
4    -1
Name: PAY_1, dtype: object

In [17]:
df_clean['PAY_1'].value_counts()

0                13087
-1                5047
1                 3261
Not available     3021
-2                2476
2                 2378
3                  292
4                   63
5                   23
8                   17
6                   11
7                    9
Name: PAY_1, dtype: int64

Temos que limpar as strings: